tutorials/multicomponentFluid/verticalChannelLTS/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFieldValue1
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    writeControl    writeTime;
    log             yes;
    writeFields     no;
    select          patch;
    name            outlet;
    operation       average;
    weightField     phi;
    fields
    (
        H2O
        T
    );
}

// ************************************************************************* //
